#include <iostream>
using namespace std;

int main() {
    setlocale (LC_CTYPE, "ukr");
    double k1, p1; // кількість та ціна м'яса
    double k2, p2; // кількість та ціна хліба
    double k3, p3; // кількість та ціна овочів

    // Введення даних
    cout << "Введіть кількість м'яса (кг) та ціну (грн./кг): ";
    cin >> k1 >> p1;
    cout << "Введіть кількість хліба (кг) та ціну (грн./кг): ";
    cin >> k2 >> p2;
    cout << "Введіть кількість овочів (кг) та ціну (грн./кг): ";
    cin >> k3 >> p3;

    // Обчислення вартості
    double totalCost = k1 * p1 + k2 * p2 + k3 * p3;

    // Виведення результату
    cout << "Загальна вартість закупівель за день: " << totalCost << " грн" << std::endl;

    return 0;
}